Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: །ཚངས་པའི་འཇིག་རྟེན་ཚངས་པའི་མཆོག །མཁས་པ་ལྷ་རྣམས་བྱེ་བ་ཡིས། །མཆོད་པ་བྱ་བའི་དབང་ཕྱུག་འགྱུར།
en: They become the foremost Brahmā in the Brahmā Heavens. Being learned, they become lords venerated By many millions of gods.

source: །གང་ཞིག་མདོ་སྡེ་དཀོན་མཆོག་འདིར། །ཕྱི་ཕྱིར་རྗེས་སུ་ཡི་རང་ན།
en: “Those who rejoice repeatedly In this precious discourse

source: །སུས་ཀྱང་དེ་ཡི་ཡོན་ཏན་མཐའ།
en: Will obtain qualities so great

source: །བརྗོད་པར་ནུས་པ་མ་ཡིན་ནོ།
en: That their extent will be inexpressible.

source: །བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ན།
en: “If they form the wish for awakening,

source: །བསྐལ་པ་བྱེ་བ་རྣམས་སུ་ཡང་། །ནམ་དུའང་ལོང་ཐེང་མི་འགྱུར་ཏེ།
en: They will not become lost,Even for ten million eons.

source: །སྟོན་པ་བླ་ན་མེད་པར་འགྱུར།
en: Instead, they will become unsurpassed teachers.

source: །རྩྭ་ཤིང་རི་དང་སྡོང་པོ་དང་། །འཁྲི་ཤིང་སྨན་ཡང་དེ་བཞིན་ཏེ།
en: “Grass blades, mountains, trees, Vines, herbs,

source: །མེ་ཏོག་འབྲས་ལྡན་ལྗོན་ཤིང་ཡང་།
en: Flowers and fruit bushes

source: །གང་དུ་འགྲོ་བར་འདུད་པར་འགྱུར།
en: Will bow down wherever they go.

source: །མར་མེ་མཛད་ནས་བཟུང་ནས་སུ།།བརྟུལ་ཞུགས་བཟང་པོ་གང་འགྲོ་བར།
en: “Engaged in the disciplined conduct Practiced since the time of Dīpaṃkara,

source: །ཕྱོགས་བཅུ་དག་གི་འཇིག་རྟེན་ཁམས། །མཐའ་ཡས་འོད་ཀྱིས་སྣང་བར་བྱེད།
en: They will illuminate with limitless light The world systems in the ten directions.

source: །གང་དག་འདས་པའི་བར་དེ་དང་། །གང་དག་མ་འོངས་ཤིང་རྣམས་ཀྱི། །མེ་ཏོག་འབྲས་བུ་ལོ་མ་དག།
en: “All the flowers, fruits, and leaves On the trees in the past, The present, and the future

source: །དེ་དག་རྣམ་པར་ཤེས་པར་ནུས།
en: Will be perceived by them.

source: །སངས་རྒྱས་བྱེ་བ་ཕྲག་སྟོང་དང་། །ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་རྣམས་ཀྱིས་ཀྱང་།
en: “Billions of buddhas, Or even many trillions of buddhas,

source: །དེ་དག་གི་ནི་ཡོན་ཏན་མཐའ།།བརྗོད་པར་ནུས་པ་མ་ཡིན་ནོ།
en: Would be unable to express The extent of their qualities.

source: །བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ནི།
en: “When bodhisattvas

source: །མདོ་འདི་ཕྱིར་ཞིང་མོས་བྱེད་པ།
en: Develop interest in this discourse,

source: །དེ་ཡི་བསྔགས་པའི་ཕྲེང་བ་ཡི།།མཐའ་མ་བརྗོད་པར་མི་ནུས་སོ།
en: It would be impossible to fully express The garlands of praise that they deserve.

source: །མདོ་སྡེ་ཡོན་ཏན་གང་བརྗོད་པ།
en: “Those who express the qualities of this discourse

source: །དེ་དག་ཐམས་ཅད་དེ་དང་ལྡན།
en: Will come to possess all those qualities themselves.

source: །དེ་བས་རབ་ཏུ་ལྷག་ཡོད་དེ།
en: They will even have more qualities than those.

source: །དེ་ཡི་ཡོན་ཏན་མཐའ་ཐུག་མེད།
en: In fact, there will be no end to their qualities.

source: །མི་གང་དེ་ལ་དགའ་བར་མི་བྱེད་ཅིང་།
en: “But those who feel no joy from this discourse,

source: །ཡོད་པ་མིན་དང་བསྔགས་པ་མི་སྨྲ་དང་།
en: Who speak badly of it, saying it is untrue when it is true,

source: །མི་གང་ཁྲོས་ནས་མི་སྙན་སྨྲ་བ་འམ།།ཡང་ན་དེ་ལ་འཁྲུགས་པ་བྱེད་པ་དག
en: Who in anger speak harshly of it, And who are agitated about it,

source: །སེམས་ཅན་དམྱལ་བར་སྐྱེ་འགྱུར་ཏེ།
en: “Such persons will be born in hell

source: །ལུས་ནི་ཆེན་པོར་གྱུར་ནས་སུ།
en: With huge bodies.

source: །དེ་ནི་སྡུག་བསྔལ་མྱོང་འགྱུར་ཏེ།
en: There they will experience painful feelings,

source: །ཡིད་རབ་མི་བདེ་མ་རུང་འགྱུར།
en: As their bodies will be tormented.

source: །དཔག་ཚད་ལྔ་བརྒྱའི་ཚད་ཙམ་དུ། །དེ་ཡི་ལུས་ནི་སྐྱེ་བར་འགྱུར།
en: “Their bodies will take on a size Measuring five hundred leagues,

source: །སྡིག་པའི་ལས་ཀྱིས་རྟག་ཏུ་ཡང་།
en: And, due to their evil actions,

source: །བྱེ་བས་བསྐོར་ནས་ཟ་བར་འགྱུར།
en: They will continually be devoured by countless beings.

source: །བསྐལ་པ་དག་ནི་དུ་མར་ཡང་།
en: “For several eons,

source: །ལུས་ནི་དཔག་ཚད་ལྔ་བརྒྱར་འགྱུར།
en: Their bodies will measure five hundred leagues.

source: །དེ་ལ་མགོ་ཡང་ལྔ་བརྒྱ་སྟེ།
en: They will have five hundred heads—

source: །དེ་ལས་ཉུང་བར་མི་འགྱུར་རོ།
en: No fewer than that.

source: །མགོ་རྣམས་རེ་རེ་དག་ལ་ཡང་།
en: “On each head they will have

source: །ལྔ་བརྒྱའི་ལྕེ་ལས་མི་ཉུང་སྟེ།
en: No fewer than five hundred tongues.

source: །ལྕེ་གཅིག་ལ་ཡང་ཐོང་གཤོལ་ནི།
en: On each tongue there will be

source: །ལྔ་བརྒྱར་ཚང་སྟེ་མི་ཉུང་བ།
en: No fewer than five hundred plows.

source: །འབར་བས་དེ་ལ་རྨོ་བྱེད་དེ།
en: “Ablaze, the plows will cut their tongues

source: །སྐུར་འདེབས་སྡིག་པའི་ལས་ཀྱིས་སོ།
en: As a result of the evil of disparaging others.

source: །ཚིག་རྩུབ་དག་ནི་སྨྲས་པས་ན།
en: By speaking harsh words,

source: །ཤིན་ཏུ་ཚ་བར་སྲེག་པར་འགྱུར།
en: They will be burned in the Hell of Extreme Heat.

source: །གང་དག་སྡོམ་པར་མི་བྱེད་ཅིང་།
en: “Those who abandon restraint

source: །བྱང་ཆུབ་སེམས་དཔའ་གནོད་བྱེད་པ།
en: And harm a bodhisattva

source: །དེ་ནི་སེམས་ཅན་དམྱལ་སྐྱེ་སྟེ།
en: Will be born in hell,

source: །དུད་འགྲོའི་སྐྱེ་གནས་འགྲོ་བར་འགྱུར།
en: And after that as animals.

source: །ཚུལ་འདི་སྤོང་བར་བྱེད་པ་ནི།།བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་དང་། །བརྒྱ་དང་ཁྲག་ཁྲིག་རྣམས་སུ་ཡང་། །མནར་མེད་པར་ནི་སྡུག་བསྔལ་རྙེད།
en: “If they dismiss this way of practice, They will reap suffering In the hell of incessant torment For billions and trillions of eons.

source: །དེ་ནས་ཤི་འཕོས་རབ་གདུག་ཅིང་།
en: “Then, after they pass away,

source: །ཤིན་ཏུ་མི་བཟད་སྦྲུལ་དུ་འགྱུར།
en: They will become horrific poisonous snakes,

source: །བཀྲེས་ཤིང་སྐོམ་པས་མངོན་གཟིར་ཀྱང་།
en: And, tormented by hunger and thirst,

source: །ཤིན་ཏུ་མི་བཟད་ལས་རྣམས་བྱེད།
en: They will act in horrendous ways.

source: །བཟའ་བ་རྙེད་ཀྱང་སྡིག་པ་ཡིས། །ནམ་ཡང་ཚིམ་པར་མི་འགྱུར་རོ།
en: “Even if they obtain food, Their evil actions will prevent any satisfaction.

source: །གལ་ཏེ་དེ་ནས་ཤི་འཕོས་ནས།
en: When they pass away from such a life,

source: །མི་ཡི་ནང་དུ་སྐྱེ་ན་ཡང་།
en: They may be born as a human.

source: །ཡིད་མི་གཞུངས་ཤིང་དམུས་ལོང་འགྱུར།
en: “Even so, they will be dimwitted and blind.

source: །གནོད་པར་སེམས་ཤིང་སྡོམ་པ་མེད།
en: They will be intent on harm and have no restraint.

source: །ཉེས་པའི་ཚིག་རྣམས་སྨྲས་ནས་ནི།
en: By speaking in negative ways,

source: །འཕགས་པ་མཉེས་པར་མི་བྱེད་པ།
en: They will displease the noble ones.

source: །མི་ཡི་ནང་ནས་ཤི་འཕོས་ནས།
en: “As they pass away from human existence,

source: །སླར་ཡང་ངན་འགྲོར་འགྲོ་བར་འགྱུར།
en: They will once again be born in the lower realms.

source: །བསྐལ་པ་བྱེ་བ་སྟོང་རྣམས་སུ།
en: For billions of eons,

source: །ནམ་ཡང་སངས་རྒྱས་མཐོང་མི་འགྱུར།
en: they will never see a buddha.

source: །གང་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་ལ།།གནོད་པར་མི་བྱེད་རབ་བསྡམས་དང་།
en: “On the other hand, by relating to a bodhisattva In a disciplined manner free from harm,

source: །གང་ཞིག་ཆོས་དང་ལྡན་པ་ཡི།།ཆོས་སྨྲ་དེ་དག་སྲུང་བྱེད་པ།
en: And by protecting those Dharma teachers Who uphold the Dharma,

source: །ངན་འགྲོ་རྣམས་ནི་ཀུན་སྤངས་ནས།
en: “They will leave all the lower realms behind

source: །བརྒྱ་བྱིན་རྫུ་འཕྲུལ་ཆེན་པོར་འགྱུར།
en: And take birth as Śakra with great miraculous abilities.

source: །ཚངས་པ་འཐབ་བྲལ་དགའ་ལྡན་དང་། །དབང་བྱེད་པར་ཡང་དེ་འགྱུར་རོ།
en: They will also come to rule the Brahmā Heavens, The Heaven Free from Strife, and the Heaven of Joy.

source: །གལ་ཏེ་མིར་ནི་གྱུར་ན་ཡང་།
en: “Even should they be born as humans,

source: །རྟག་ཏུ་འཁོར་ལོས་སྒྱུར་བར་འགྱུར།
en: They will always be universal monarchs.

source: །ཚོང་དཔོན་དང་ནི་ཁྱིམ་བདག་འགྱུར།
en: As guild masters and householders,

source: །རྟག་ཏུ་སྐྱིད་ཅིང་ནོར་ཆེར་འགྱུར།
en: They will always find happiness and great wealth.

source: །ཇི་ལྟར་གང་གཱའི་བྱེ་སྙེད་ཀྱི།།བསྐལ་པ་དེ་སྙེད་རྟག་ཏུ་ཡང་།
en: “For as many eons as there are grains of sand in the Ganges,

source: །འཇིགས་མེད་དྲན་པ་ཕུན་སུམ་ཚོགས།
en: With fearlessness, perfect mindfulness,

source: །བདེ་དང་ལྡན་ཞིང་གནོད་པ་མེད།
en: Happiness, and safety.

source: །ཚེ་རབས་ཚེ་རབས་ཕྱི་ཕྱིར་ཞིང་།
en: “Life after life,

source: །རྟག་ཏུ་སངས་རྒྱས་མཆོད་པར་འགྱུར།
en: They will always venerate the Buddha.

source: །བློ་ལྡན་གང་ཞིག་སངས་རྒྱས་ལ།།བསྐལ་པ་དེ་སྙེད་མཆོད་པ་བས།
en: Intelligent beings May venerate the Buddha throughout many eons,

source: །ཕྱི་དུས་ཆོས་ནི་འཇིག་པ་ན།།གང་དག་མདོ་སྡེ་འདི་འཛིན་པ།།ཆོས་གང་འཇིག་རྟེན་མགོན་པོ་ཡིས། །བསྟན་པའི་མདོ་སྡེ་འདི་ལ་དེས།
en: “Yet other persons may remember This discourse Which was taught by the Protector of the World, When the Dharma disappears in the future.

source: །ཉིན་ཞག་གཅིག་ཏུ་བཟུང་བ་ཡི།
en: “Even remembering it for just a single day,

source: །དེ་ནི་བསོད་ནམས་ཁྱད་པར་འཕགས།
en: They will gain much more merit than those former persons,

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་གང་བཞུགས་པ།
en: And to all the buddhas in the ten directions

source: །དེ་དག་ཀུན་ལ་མཆོད་པར་འགྱུར།
en: They will offer homage.

source: །མདོ་སྡེ་འདི་འདྲ་འཛིན་པ་ནི།
en: “To remember a discourse such as this

source: །གང་དག་མ་འོངས་སངས་རྒྱས་དང་། །འདས་པའི་སངས་རྒྱས་གང་དག་དང་། །དེ་དག་དེ་ཡིས་མཆོད་པར་འགྱུར།
en: Is to venerate The buddhas of the future And the buddhas of the past.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་གནོད་སེམས་དང་། ཐ་བ་དང་ཁྲོ་བ་སྐྱེད་དམ།
en: “Mañjuśrī, if bodhisattvas should develop any ill will, animosity, or anger toward other bodhisattvas who are devoted to this absorption of the miraculous ascertainment of peace;

source: འདུམ་པར་མི་བྱེད་དམ།བརྙས་ཐབས་གང་ཡང་རུང་བས་བརྙས་ཏེ།ངན་པའི་རིགས་སུ་སྐྱེས་པ་ཞེའམ། རྙེད་པ་ཆུང་བ་ཞེའམ། ཡིད་གཞུངས་པ་ཆུང་བ་ཞེའམ། ཤེས་རབ་ཆུང་བ་ཞེས་བརྙས་སམ་ཅི་ཡང་རུང་སྟེ།
en: or if they should go against them and make trouble for them by saying that they come from low families, have few possessions, or have little insight;

source: ཚུལ་ཁྲིམས་ཀྱི་ཡན་ལག་ཉམས་པ་ཞེའམ། མདོག་ངན་པ་ཞེའམ། གཟུགས་དང་མི་ལྡན་པ་ཞེའམ། གཟི་བརྗིད་ཆུང་བ་ཞེས་བརྙས་སམ།
en: or if they should accuse them of having damaged discipline, bad complexion, ugly appearance, or no charisma;

source: ཐ་ན་ཡུད་ཙམ་ཞིག་ཁྲོས་ཏེ་ལྟ་ན་ཡང་དེ་མི་དགེ་བའི་ལས་དེས་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་པ་ཚང་བར་ངན་སོང་རྣམས་སུ་སྲེག་པར་འགྱུར་རོ།
en: or even if they should just feel a moment of resentment for those bodhisattvas, such negative karma will cause them to burn in the lower realms for an uncountable number of millions of eons.

source: །འཇམ་དཔལ་ངས་ནི་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཁོང་ཁྲོ་བའི་སེམས་གཅིག་བསྐྱེད་པ་ལས་ཁ་ན་མ་ཐོ་བ་ཆེ་བའི་ཆོས་དེ་ལྟ་བུ་གཅིག་ཀྱང་མ་མཐོང་ངོ་།
en: “Mañjuśrī, I do not see any evil whatsoever that is greater than developing ill will toward such bodhisattvas.

source: །འཇམ་དཔལ་རིགས་ཀྱི་བུའམ།རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ལ་མཚོན་གྱིས་བཏབ་བམ། དབྱུག་པས་བརྡེགས་པ་བས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གཞན་གང་གིས་ཐེག་པ་ཆེན་པོ་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཐ་ན་གནོད་སེམས་སམ། ཐ་བའམ། ཞེ་སྡང་གི་སེམས་གཅིག་བསྐྱེད་དམ།ཁྲོས་ཏེ་བརྙས་པའི་སེམས་བསྐྱེད་ན་དེ་དེ་བས་སྡིག་པ་ཆེས་མང་དུ་སྐྱེད་དོ།
en: Mañjuśrī, compared to noble sons or daughters who strike with weapons or beat with sticks all beings in all the world systems in the great trichiliocosm, noble sons or daughters who feel just a moment of ill will, animosity, or anger toward bodhisattvas who are devoted to the Great Vehicle, or who feel anger toward those bodhisattvas and then form the wish to cause those bodhisattvas trouble, bring about much greater nonvirtue.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཁོང་ཁྲོ་བའི་སེམས་བསྐྱེད་པའམ། བརྙས་པའི་སེམས་བསྐྱེད་པ་ཇི་ཙམ་པ་དེ་སྙེད་ཀྱི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའ་དེས་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་གནས་པར་གོ་ཆ་བགོ་བར་བྱའོ།
en: Mañjuśrī, as many times as bodhisattvas give rise to anger toward, or cause trouble for, other bodhisattvas, for that many eons those bodhisattvas must prepare to don their armor for life as hell beings.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྐུར་པ་བཏབ་པ་མ་གཏོགས་པར། བྱང་ཆུབ་སེམས་དཔའ་ལས་གཞན་གང་གིས་ཀྱང་ལོག་པར་ལྟུང་བར་བྱེད་མི་ནུས་སོ།
en: “Mañjuśrī, apart from criticizing other bodhisattvas, no other action is able to cause a bodhisattva’s downfall.

source: །འཇམ་དཔལ་འདི་ལྟ་སྟེ་དཔེར་ན་ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེ་ནི་རྡོ་རྗེ་ཉིད་མ་གཏོགས་པར་ཤིང་ངམ། བོང་བའམ། དབྱུག་པའམ། རྡོ་བའམ།མཚོན་ཆས་གཅག་པར་མི་ནུས་སོ།
en: Mañjuśrī, it is like this: Apart from a diamond, no other substance, such as wood, soil, sticks, or weapons, is able to cut a diamond.

source: །འཇམ་དཔལ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྐུར་པ་བཏབ་པ་མ་གཏོགས་པར་ལས་གཞན་གྱིས་ལོག་པར་ལྟུང་བར་བྱེད་མི་ནུས་སོ།
en: Mañjuśrī, likewise, other than bodhisattvas criticizing other bodhisattvas, no action can bring about their downfall.

source: །འཇམ་དཔལ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་ལྷའི་བསྐལ་པ་བྱེ་བར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རེ་རེར་འཁོར་བཞི་ལ་ཅི་འདོད་པ་སྦྱིན་པ་བྱིན་པ་བས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གཞན་གྱིས། འཐུན་པར་བྱ་བའི་དོན་དུ་གཡོས་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པའོ། །དེ་བཞིན་གཤེགས་པ་ནི་གཡུང་དྲུང་ངོ་ཞེས་ཚིག་ཏུ་སྨྲ་ན་ཡང་དེ་དེ་བས་ཆེས་བསོད་ནམས་གྲངས་མེད་པར་སྐྱེད་དོ།
en: Mañjuśrī, compared to noble sons or daughters who distribute offerings to the four assemblies according to their wishes in each of the world systems in the ten directions for ten million divine eons, other noble sons or daughters who are motivated by a desire for harmony will create infinitely greater virtue merely by saying, ‘The Thus-Gone One is permanent, the Thus-Gone One is changeless.’

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལས་ལྷའི་ལོ་སྟོང་དུ་དཀོན་མཆོག་གསུམ་ལ་ཅི་དགོས་པ་བྱིན་པ་བས།
en: “Mañjuśrī, compared to bodhisattvas who offer the Three Jewels everything they need for one thousand years of the god realms,

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གཞན་ཞིག་ཐ་ན་སེ་གོལ་གཏོགས་པ་སྲིད་དུ་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པའོ། །འདུ་བྱེད་ཐམས་ཅད་ནི་སྡུག་བསྔལ་བའོ། །འདུ་བྱེད་ཐམས་ཅད་ནི་སྟོང་པའོ། །འདུ་བྱེད་ཐམས་ཅད་ནི་བདག་མེད་པའོ། །སྙམ་དུ་དཔྱོད་ན་དེ་དེ་བས་བསོད་ནམས་ཆེས་གྲངས་མེད་པར་སྐྱེད་དོ།
en: other bodhisattvas will create infinitely greater virtue by thinking for merely as long as it takes a person to snap two fingers, ‘All conditioned things are impermanent. All conditioned things are suffering. All conditioned things are empty. All conditioned things are without a self.’ ”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཤད་པ་ན་ལྷའི་བུ་བརྒྱད་སྟོང་ནི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ།
en: When the Thus-Gone One had delivered this Dharma teaching, eight thousand divine sons formed the attitude set upon awakening,

source: །དགེ་སློང་མ་ལྔ་བརྒྱ་ནི་ཐེག་པ་གཅིག་ཏུ་ཡང་དག་པར་འདུ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ།
en: five hundred nuns obtained the absorption that gathers all into a single vehicle,

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཉིས་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པར་གྱུར་ཏོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ།
en: twelve hundred bodhisattvas attained acceptance that phenomena are unborn, and the entire great trichiliocosm shook in six different ways.

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་སྟེང་གི་བར་སྣང་ལས་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་རྣམས་ཀྱི་ཆར་ཆེན་པོ་ཡང་རབ་ཏུ་བབ་བོ། །ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་སྤོས་ཀྱི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་རབ་ཏུ་བབ་བོ། །གོས་ཀྱི་ཆར་དང་རིན་པོ་ཆེའི་ཆར་དང་རྒྱན་གྱི་ཆར་ཆེན་པོ་ཡང་རབ་ཏུ་བབ་བོ།
en: In order to venerate this Dharma teaching as well as the Blessed One Śākyamuni, from the sky above a heavy rain of divine flowers, such as blue lotuses, red lotuses, water lilies, and white lotuses, fell along with a downpour of sandalwood incense, fabrics, gems, and jewelry.

source: །འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་བརྗོད་དུ་མེད་པའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་དེའི་ཚེ།
en: At that time as many bodhisattva great beings as there are atoms in all the ineffably countless universes paid homage to this Dharma teaching.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རེ་རེས་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ལག་པ་མངོན་པར་སྤྲུལ་ཏེ།
en: They did so by each emanating as many hands as there are atoms in the buddha realms in the ten directions.

source: ལག་པ་རེ་རེས་ཀྱང་ལྷའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཚད་ཙམ་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མེད། གཞལ་དུ་མེད་པའི་གདུགས་ཀྱི་སྤྲིན་དང་། རྒྱལ་མཚན་གྱི་སྤྲིན་དང་། བ་དན་གྱི་སྤྲིན་དང་། མེ་ཏོག་གི་སྤྲིན་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་སྤྲིན་དང་། རྒྱན་གྱི་སྤྲིན་དང་། སེང་གེའི་རྒྱལ་མཚན་ཟླ་བའི་སྤྲིན་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྣང་བ་ཐམས་ཅད་བསགས་པའི་སྤྲིན་དང་། ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོའི་སྤྲིན་རྣམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་དོ།
en: With each hand they made countless, unimaginable, incomparable, and immeasurable offerings as large as the divine realms, sending forth cloud banks of parasols, banners, standards, flowers, sandalwood incense, jewelry, bright lion banners, gems that shone in all colors, and wish-fulfilling jewels.

source: །བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ཡང་གཏོར་ཅིང་མངོན་པར་གཏོར་ནས་ཚིག་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་ལེགས་པར་གསུངས་སོ།
en: As they laid all this before the Blessed One Śākyamuni, they said: “Blessed One, you have spoken well!

source: །བདེ་བར་གཤེགས་པས་ལེགས་པར་གསུངས་ཏེ།
en: Well-Gone One, you have spoken well!

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཇིག་རྟེན་དུ་ཡུན་རིང་དུ་གནས་པར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ།
en: May this Dharma teaching Remain long in this world!”

source: །སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དང་། ལྷའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད་བརྗོད་དུ་མེད་པ་རྣམས་ཀྱིས་ཀྱང་ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་དང་མན་དཱ་ར་བ་ཆེན་པོ་དང་། མཉྫུ་ཥ་ཀ་དང་ཡིད་དགའ་དང་པ་རུ་ཥ་ཀ་དང་ཏ་ར་ཎི་དང་བ་ལ་ལ་ཀི་དང་། ཀོ་ཏ་ར་ཎི་དང་དྲི་མཆོག་དང་དྷ་ནུ་སྐ་རི་དེ་བ་དང་ཨུད་པལ་དང་པད་མ་དང་ཀུ་མུ་ད་དང་པད་མ་དཀར་པོ་དང་། མེ་ཏོག་འཁོར་ལོ་དང་འཁོར་ལོ་ཆེན་པོ་ལ་སོགས་པ་ལྷའི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་རབ་ཏུ་ཕབ་བོ།
en: At that point, a countless and inconceivable number of trillions of gods and goddesses—a number so immeasurable and inexpressible that it equals the number of atoms found in all the ineffably many billions of buddha realms—showered down a rain of divine flowers, such as mandārava, mahāmandārava, mañjuṣaka, sumanas, paruṣaka, taraṇi, balalaki, kotaraṇi, saugandhika, and dhanuṣkarideva flowers, blue lotuses, pink lotuses, water lilies, and white lotuses, as well as cakra and mahācakra flowers.

source: །ལྷའི་གོས་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་གྱི་ཆར་རབ་ཏུ་ཕབ་བོ། །ལྷའི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཆར་དང་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་དང་རྒྱན་གྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་བོ།
en: They also brought down a rain of divine fabrics, parasols, banners, standards, sandalwood incense, and cloud banks of gems and jewelry.

source: །བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་གྲངས་མེད་པས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་འཛམ་བུའི་གླིང་གི་ཚད་ཙམ་གྱི་མེ་ཏོག་གི་སྤྲིན་དང་། གོས་ཀྱི་སྤྲིན་དང་རིན་པོ་ཆེའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་ཕབ་བོ།
en: Śakra, Brahmā, and an utterly incalculable number of trillions of guardians of the world paid homage to this Dharma teaching by bringing down a shower of cloud banks of flowers, fabrics, and jewels the size of the entire world.

source: །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་མི་འམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་གཞལ་དུ་མེད། ཚད་མེད་པ་དག་གིས་ཀྱང་ལྷའི་མེ་ཏོག་གི་ཆར་དང་། སྤོས་དང་གོས་དང་རིན་པོ་ཆེའི་ཆར་མངོན་པར་ཕབ་སྟེ།
en: Likewise, an incalculable, inconceivable, immeasurable, and boundless number of trillions of nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas showered down a rain of divine flowers, incense, fabrics, and gems.

source: ལྷའི་རོལ་མོའི་དབྱངས་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པ་བྱས་ནས་ཚིག་འདི་སྐད་ཅེས་བཅོམ་ལྡན་འདས་ལེགས་པར་གསུངས་སོ།
en: Accompanied by inconceivable melodies from their divine instruments, they exclaimed: “Blessed One, you have spoken well!

source: ཀྱེ་མའོ་བདག་ཅག་གིས་སྔོན་མ་ཐོས་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་སོ།
en: Oh, we have heard a Dharma teaching that was never heard before!

source: །ཀྱེ་མའོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡུན་རིང་དུ་གནས་པར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ།
en: Oh, may this Dharma teaching remain for long!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་གྲངས་མེད་པ་དག་དང་། བཟང་སྐྱོང་ལ་སོགས་པ་དགེ་བསྙེན་སྟོང་ཕྲག་དཔག་ཏུ་མེད་པ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དག་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་བརྒྱ་ཕྲག་གྲངས་མེད་པ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: After the Blessed One had spoken, Mañjuśrī Kumārabhūta, the limitless and incalculable number of other bodhisattvas, the many thousands of lay practitioners such as Bhadrapāla, the great hearers, and the many hundreds of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas all rejoiced in and extolled the Buddha’s speech.

source: །འཕགས་པ་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: This completes the noble Great Vehicle sūtra “The Absorption of the Miraculous Ascertainment of Peace.” This sūtra was translated, proofed, and finalized according to the revised terminology by the Indian preceptors Jinamitra and Dānaśīla together with the translator-editor Bandé Yeshé Dé.
